# задача
# Дана пицца 8 кусочков. Доступны команды:
# 1. print(‘Взять кусок’)
# 2. print(‘съесть кусок’)
# написать программу, симулующую поедание кусочков пиццы (По желанию можно анимацию убывание кусочков пиццы добавить)


shapePizza = 8
while shapePizza >=1:
    shapePizza -=1
    print ('Осталось ', shapePizza, 'кусков')


# Выведите столбец чисел от 1 до 100, используя цикл while
i= 1
while i <= 100:
    print (i)
    i += 1

# задача
# Дано число n. Вывести степени этого числа с 1 по 10
num = 2
n = 1
while n <= 10:
    print (num ** n)
    n +=1



